In [1]:
import pandas as pd

## Question 1:

    List any five functions of pandas library with execution

In [2]:
data= {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}

df = pd.DataFrame(data)

In [5]:
round(df['Age'].mean(), 2)

27.33

In [7]:
df['Name'].sort_values(ascending=False)

2    Claire
1       Bob
0     Alice
Name: Name, dtype: object

In [11]:
df.groupby('Gender').sum()

        Age
Gender
Female   52
Male     30

In [13]:
df['Gender'].value_counts()

Female    2
Male      1
Name: Gender, dtype: int64

In [15]:
df['Name'].unique()

array(['Alice', 'Bob', 'Claire'], dtype=object)

## Question 2:

Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [181]:
data = {
    'A': [1,2,3,4,10],
    'B': [5,6,7,8,10],
    'C': [9,10,11,12,20]
}

df = pd.DataFrame(data)

In [182]:
df

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
4  10  10  20

In [183]:
def re_index_dataframe(df):
    new_index = pd.RangeIndex(start=1, stop=len(df)*2, step=2)
    new_df = df.set_index(new_index)
    return new_df

In [184]:
new_df = reindex_dataframe(df)

In [185]:
new_df

    A   B   C
1   1   5   9
3   2   6  10
5   3   7  11
7   4   8  12
9  10  10  20

## Question 3

You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console. 

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [186]:
data3 = {
    'subject':['maths', 'english', 'physics', 'geo', 'science', 'eco', 'history'],
    'Values':[10, 20, 30, 40, 50, 70, 10]
}

df3 = pd.DataFrame(data3)

In [187]:
def sum_first_three_values(df):
    count = 3
    n_lst = []
    for num in df:
        if len(n_lst) == count:
            break
        else:
            n_lst.append(num)
    
    return f'Sum of first three values: {sum(n_lst)}'

In [188]:
sum_first_three_values(df3['Values'])

'Sum of first three values: 60'

# Lets try something less complex

In [172]:
def sum_first_three_values2(df):
    values = df['Values'].iloc[:3]
    total = values.sum()
    print("Sum of first three values:", total)

In [173]:
sum_first_three_values2(df3)

Sum of first three values: 60

## Question 4

Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [174]:
data4 = {
    'Text': ["Hello there!", "How are you today?", "Python is a great programming language", "I love pizza", "What's your favorite color?", "Today is a beautiful day"]
}

df4 = pd.DataFrame(data4)

In [175]:
df4

                                     Text
0                            Hello there!
1                      How are you today?
2  Python is a great programming language
3                            I love pizza
4             What's your favorite color?
5                Today is a beautiful day

In [178]:
def world_count(df):
    return len(df.split())

In [179]:
df4['Word_Count'] = df4['Text'].apply(world_count)

In [180]:
df4

                                     Text  Word_Count
0                            Hello there!           2
1                      How are you today?           4
2  Python is a great programming language           6
3                            I love pizza           3
4             What's your favorite color?           4
5                Today is a beautiful day           5

## Question 5

How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size and DataFrame.shape are both methods of Pandas DataFrames, but they provide different information about the DataFrame.

DataFrame.size returns the total number of elements in the DataFrame, which is calculated by multiplying the number of rows by the number of columns. For example, if you have a DataFrame with 5 rows and 4 columns, DataFrame.size will return 20.

On the other hand, DataFrame.shape returns a tuple that contains the number of rows and columns in the DataFrame. For example, if you have a DataFrame with 5 rows and 4 columns, DataFrame.shape will return (5, 4).

In [189]:
df5= df4.copy()

In [194]:
df5

                                     Text  Word_Count
0                            Hello there!           2
1                      How are you today?           4
2  Python is a great programming language           6
3                            I love pizza           3
4             What's your favorite color?           4
5                Today is a beautiful day           5

In [197]:
df5.size

# DataFrame.size returns the total number of elements in the DataFrame.

12

In [196]:
df5.shape

# DataFrame.shape returns a tuple with the number of rows and columns in the DataFrame.

(6, 2)

## Question 6

Which function of pandas do we use to read an excel file?

To read an Excel file in pandas, you can use the "read_excel()" function. This function can be used to read data from an Excel file and create a pandas DataFrame object.

## Question 7

You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [213]:
data7 = {
    'Email': [
    "john.smith@example.com",
    "jane.@doe@example.com",
    "sarah.jones@example.com",
    "james.@brown@example.com",
    "mary.white@example.com",
    "peter.green@example.com",
    "lisa.#black@example.com",
    "michael.lee@example.com",
    "emily.@nguyen@example.com",
    "alexander.wang@example.com"
]}

df7 = pd.DataFrame(data7)

df7

                        Email
0      john.smith@example.com
1       jane.@doe@example.com
2     sarah.jones@example.com
3    james.@brown@example.com
4      mary.white@example.com
5     peter.green@example.com
6     lisa.#black@example.com
7     michael.lee@example.com
8   emily.@nguyen@example.com
9  alexander.wang@example.com

In [215]:
# to solve this we will use the str.rfind() function in other to get the first occrurance of '@' from the right, because must email format ends like that.
# if we use str.find() this may not be correct all the time bcos, someone username may have an '@' in between E.G. john@doe@gmail.com

def username_extract(df):
    index_position = df.rfind('@')
    return df[:index_position]

In [216]:
#  Now lets create a new column

df7['Username'] = df7['Email'].apply(username_extract)

In [217]:
df7

                        Email        Username
0      john.smith@example.com      john.smith
1       jane.@doe@example.com       jane.@doe
2     sarah.jones@example.com     sarah.jones
3    james.@brown@example.com    james.@brown
4      mary.white@example.com      mary.white
5     peter.green@example.com     peter.green
6     lisa.#black@example.com     lisa.#black
7     michael.lee@example.com     michael.lee
8   emily.@nguyen@example.com   emily.@nguyen
9  alexander.wang@example.com  alexander.wang

## Question 8

You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [293]:
data8 = {
    'A':[3,8,6,2,9,6,6],
    'B':[5,2,9,3,1,9,11],
    'C':[1,7,4,5,2,4,5]
}

df8 = pd.DataFrame(data8)
df8

   A   B  C
0  3   5  1
1  8   2  7
2  6   9  4
3  2   3  5
4  9   1  2
5  6   9  4
6  6  11  5

In [294]:
# this function only works if the dataframe index starts for zero with a step of 1
def row_drop(df):
    row_list = [i for i in df.index if df['A'].values[i] > 5 and df['B'].values[i] < 10]
    return df.iloc[row_list]

In [296]:
new_df8 =row_drop(df8)

new_df8

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2
5  6  9  4

## Question 9

Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [298]:
df9 = df3.copy()

In [299]:
df9

   subject  Values
0    maths      10
1  english      20
2  physics      30
3      geo      40
4  science      50
5      eco      70
6  history      10

In [301]:
def mean_median_std(df):
    mean = round(df['Values'].mean(), 2)
    median = round(df['Values'].median(), 2)
    std = round(df['Values'].std(), 2)
    mms_dict = {'Mean':mean, 'Median':median, 'Standard_Deviation':std}
    return mms_dict

In [302]:
mean_median_std(df9)

{'Mean': 32.86, 'Median': 30.0, 'Standard_Deviation': 22.15}

## Question 10:

Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [310]:
import random
import datetime

sales_data = {'sales': [],
              'dates': []}

start_date = datetime.date(2023, 1, 1)

for i in range(50):
    sales_data['sales'].append(random.randint(50, 500))
    sales_data['dates'].append(start_date + datetime.timedelta(days=i))
    
df10 = pd.DataFrame(sales_data)
df10['dates'] = pd.to_datetime(df10['dates'])
df10.head()

   sales      dates
0    208 2023-01-01
1    155 2023-01-02
2    397 2023-01-03
3     69 2023-01-04
4    146 2023-01-05

In [311]:
df10.dtypes

sales             int64
dates    datetime64[ns]
dtype: object

In [345]:
def rolling_average(df):
    df['MovingAverage'] = df['sales'].rolling(window=7).mean()
    df['Day'] = df['dates'].dt.weekday
    return df

In [346]:
new_df10 = rolling_average(df10)

new_df10.head(10)

   sales      dates  MovingAverage  Day
0    208 2023-01-01            NaN    6
1    155 2023-01-02            NaN    0
2    397 2023-01-03            NaN    1
3     69 2023-01-04            NaN    2
4    146 2023-01-05            NaN    3
5    217 2023-01-06            NaN    4
6    181 2023-01-07     196.142857    5
7    142 2023-01-08     186.714286    6
8    113 2023-01-09     180.714286    0
9    336 2023-01-10     172.000000    1

## Question 11

You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [341]:
sales_data = {'sales': [],
              'dates': []}

start_date = datetime.date(2023, 1, 1)

for i in range(20):
    sales_data['sales'].append(random.randint(50, 500))
    sales_data['dates'].append(start_date + datetime.timedelta(days=i))
    
df11 = pd.DataFrame(sales_data)
df11['dates'] = pd.to_datetime(df10['dates'])
df11['weekday'] = df11['dates'].dt.day_name()
df11.head()

   sales      dates    weekday
0    162 2023-01-01     Sunday
1    300 2023-01-02     Monday
2    468 2023-01-03    Tuesday
3    293 2023-01-04  Wednesday
4    349 2023-01-05   Thursday

## Question 12

Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [347]:
df12 = df10.copy()

df12.head()

   sales      dates  MovingAverage  Day
0    208 2023-01-01            NaN    6
1    155 2023-01-02            NaN    0
2    397 2023-01-03            NaN    1
3     69 2023-01-04            NaN    2
4    146 2023-01-05            NaN    3

In [352]:
df12[(df12['dates'] >= '2023-01-01') & (df12['dates'] <= '2023-01-31')]

    sales      dates  MovingAverage  Day
0     208 2023-01-01            NaN    6
1     155 2023-01-02            NaN    0
2     397 2023-01-03            NaN    1
3      69 2023-01-04            NaN    2
4     146 2023-01-05            NaN    3
5     217 2023-01-06            NaN    4
6     181 2023-01-07     196.142857    5
7     142 2023-01-08     186.714286    6
8     113 2023-01-09     180.714286    0
9     336 2023-01-10     172.000000    1
10    480 2023-01-11     230.714286    2
11     80 2023-01-12     221.285714    3
12     79 2023-01-13     201.571429    4
13     69 2023-01-14     185.571429    5
14    479 2023-01-15     233.714286    6
15    409 2023-01-16     276.000000    0
16    185 2023-01-17     254.428571    1
17    361 2023-01-18     237.428571    2
18    246 2023-01-19     261.142857    3
19    388 2023-01-20     305.285714    4
20    392 2023-01-21     351.428571    5
21    368 2023-01-22     335.571429    6
22    321 2023-01-23     323.000000    0
23    113 2023-01-24     312.714286    1
24    411 2023-01-25     319.857143    2
25    275 2023-01-26     324.000000    3
26    176 2023-01-27     293.714286    4
27    431 2023-01-28     299.285714    5
28    433 2023-01-29     308.571429    6
29    413 2023-01-30     321.714286    0
30    172 2023-01-31     330.142857    1

# Question 13

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [353]:
import pandas as pd